In [82]:
import pandas as pd
import numpy as np
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [83]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [84]:
inputs=df.drop(['Survived'],axis='columns')
target=df.Survived

In [85]:
dummy=pd.get_dummies(inputs.Sex)
dummy.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [86]:
inputs=pd.concat([inputs,dummy],axis='columns')
inputs.head(4)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0

In [87]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(4)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1

In [89]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [91]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [92]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [93]:
model.fit(X_train,y_train)

GaussianNB()

In [94]:
model.score(X_test,y_test)

0.7910447761194029

In [95]:
X_test[0:10]

     Pclass        Age      Fare  female
118       1  24.000000  247.5208       0
497       3  29.699118   15.1000       0
375       1  29.699118   82.1708       1
359       3  29.699118    7.8792       1
314       2  43.000000   26.2500       0
262       1  52.000000   79.6500       0
380       1  42.000000  227.5250       1
849       1  29.699118   89.1042       1
355       3  28.000000    9.5000       0
137       1  37.000000   53.1000       0

In [96]:
y_test[0:10]

118    0
497    0
375    1
359    1
314    0
262    0
380    1
849    1
355    0
137    0
Name: Survived, dtype: int64

In [97]:
model.predict(X_test[0:10])

array([1, 0, 1, 1, 0, 0, 1, 1, 0, 0], dtype=int64)

In [98]:
model.predict_proba(X_test[:10])

array([[1.14034750e-08, 9.99999989e-01],
       [9.63456868e-01, 3.65431316e-02],
       [2.33255608e-02, 9.76674439e-01],
       [4.43555669e-01, 5.56444331e-01],
       [9.34549927e-01, 6.54500726e-02],
       [5.05279529e-01, 4.94720471e-01],
       [1.12293229e-08, 9.99999989e-01],
       [1.65263941e-02, 9.83473606e-01],
       [9.61937042e-01, 3.80629577e-02],
       [7.15935737e-01, 2.84064263e-01]])

In [99]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.776     , 0.736     , 0.8       , 0.76612903, 0.76612903])